Documents/Requests/Soap_Getcustomerdetails_cable__25_02_2022_07_30_42_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                    <ID>1e3b5175-517f-45c9-812c-ed9118756149</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>bb09baf5-20d1-4fe0-bff6-b3eefa4dfe99</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T05:48:42.470Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>KD_</GlobalID>
                    <Mode>2</Mode>
                    <SourceSystemID> </SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>